In [39]:
import pandas as pd
import numpy as np

In [40]:
help(np)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [41]:
data={"state":["mh","mp"],
      "year":[2000,2001],
      "pop" :[1.2,2.2]}

In [7]:
data

{'state': ['mh', 'mp'], 'year': [2000, 2001], 'pop': [1.2, 2.2]}

In [8]:
frame=pd.DataFrame(data)

In [9]:
frame

  state  year  pop
0    mh  2000  1.2
1    mp  2001  2.2

In [14]:
frame[['state','year']]

  state  year
0    mh  2000
1    mp  2001

In [18]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [20]:
pd.DataFrame(data,columns=['year','state','pop'])

   year state  pop
0  2000    mh  1.2
1  2001    mp  2.2

In [29]:
frame=pd.DataFrame(data,columns=['year','state','pop'],index=["kk","ll"] )

In [30]:
frame.index

Index(['kk', 'll'], dtype='object')

In [32]:
pd.frame.debt

AttributeError: module 'pandas' has no attribute 'frame'

In [36]:
frame.iloc[[0]]

    year state  pop
kk  2000    mh  1.2

In [44]:
np.arange(5)

array([0, 1, 2, 3, 4])

In [46]:
help(np.arange)

Help on built-in function arange in module numpy:

arange(...)
    arange([start,] stop[, step,], dtype=None)

    Return evenly spaced values within a given interval.

    Values are generated within the half-open interval ``[start, stop)``
    (in other words, the interval including `start` but excluding `stop`).
    For integer arguments the function is equivalent to the Python built-in
    `range` function, but returns an ndarray rather than a list.

    When using a non-integer step, such as 0.1, the results will often not
    be consistent.  It is better to use `numpy.linspace` for these cases.

    Parameters
    ----------
    start : number, optional
        Start of interval.  The interval includes this value.  The default
        start value is 0.
    stop : number
        End of interval.  The interval does not include this value, except
        in some cases where `step` is not an integer and floating point
        round-off affects the length of `out`.
    step : number, optional
        Spacing between values.  For any output `out`, this is the distance
        between two adjacent values, ``out[i+1] - out[i]``.  The default
        step size is 1.  If `step` is specified as a position argument,
        `start` must also be given.
    dtype : dtype
        The type of the output array.  If `dtype` is not given, infer the data
        type from the other input arguments.

    Returns
    -------
    arange : ndarray
        Array of evenly spaced values.

        For floating point arguments, the length of the result is
        ``ceil((stop - start)/step)``.  Because of floating point overflow,
        this rule may result in the last element of `out` being greater
        than `stop`.

    See Also
    --------
    linspace : Evenly spaced numbers with careful handling of endpoints.
    ogrid: Arrays of evenly spaced numbers in N-dimensions.
    mgrid: Grid-shaped arrays of evenly spaced numbers in N-dimensions.

    Examples
    --------
    >>> np.arange(3)
    array([0, 1, 2])
    >>> np.arange(3.0)
    array([ 0.,  1.,  2.])
    >>> np.arange(3,7)
    array([3, 4, 5, 6])
    >>> np.arange(3,7,2)
    array([3, 5])

In [49]:
frame.T.T

    year state  pop
kk  2000    mh  1.2
ll  2001    mp  2.2

In [52]:
np.arange(16).reshape((2,2,4))

array([[[ 0,  1,  2,  3],
        [ 4,  5,  6,  7]],

       [[ 8,  9, 10, 11],
        [12, 13, 14, 15]]])

In [53]:
data

{'state': ['mh', 'mp'], 'year': [2000, 2001], 'pop': [1.2, 2.2]}

In [54]:
frame

    year state  pop
kk  2000    mh  1.2
ll  2001    mp  2.2

In [56]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=["ujain","kashi","prayag","rameshwar"],
                  columns=["one","two","three","four"])

In [57]:
data

           one  two  three  four
ujain        0    1      2     3
kashi        4    5      6     7
prayag       8    9     10    11
rameshwar   12   13     14    15

In [70]:
data.iloc[0:3,1:3]

        two  three
ujain     1      2
kashi     5      6
prayag    9     10